# StairsRunActualNumberOfRisers Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsRunActualNumberOfRisers Property
ParameterTypeId Class See Also
---
"Actual Number of Risers": Actual Number of Risers
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsRunActualNumberOfRisers { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsRunActualNumberOfRisers As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsRunActualNumberOfRisers {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace